package io.cygnuxltb.console.controller;

import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.RestController;

/**
 * 辞典
 */
@RestController("/dict")
public class DictionaryController {

    /**
     * Page1:
     * /-
     * /-1.交易执行
     * /--(1).策略下拉列表 -> 策略服务:获取全部策略
     * /--(2).证券代码下拉列表 -> 交易标的查询接口:获取可交易标的
     * /--(3).委托按钮 -> 订单服务接口:创建订单[开仓/平仓/一键平仓接口]
     * ----------------------------------------------------------------------------
     * /-2.持仓
     * /--(1).列表 -> 仓位查询接口:查询当前持仓
     * ----------------------------------------------------------------------------
     * /-3.当日委托
     * /--(1).列表 -> 订单服务接口:查询Order
     * ----------------------------------------------------------------------------
     * /-4.当日成交
     * /--(1).列表 -> 订单服务接口:查询Order
     * ============================================================================
     * ============================================================================
     * Page2:
     * /-
     * /-1.目标池
     * /--(1).策略名称 -> 投资组合接口:获取用户投资组合
     * /--(2).添加股票 -> 交易标的接口:
     * /--(3).股票名称代码 -> 交易标的查询接口
     * /--(4).现价 -> 交易标的查询接口:获取最新价格
     * /--(5).持仓 -> 仓位查询接口:查询当前持仓
     * /--(6).涨幅 -> 交易标的查询接口:获取结算信息
     * /--(7).操作 -> 订单服务接口:创建订单[开仓/平仓/一键平仓接口]
     * ----------------------------------------------------------------------------
     * /-2.添加策略
     * /--(1).添加策略 -> 策略服务:
     * ----------------------------------------------------------------------------
     * /-3.当前订单:一键清仓 -> 订单服务接口:创建订单[开仓/平仓/一键平仓接口]
     * ----------------------------------------------------------------------------
     * /-4.当前订单
     * /--(1).名称 -> 订单服务接口:获取订单最新状态
     * /--(2).持仓 -> 仓位查询接口:查询当前持仓
     * /--(3).盈亏 -> PNL服务接口:查询结算PNL
     * /--(4).操作作 -> 订单服务接口:创建订单[开仓/平仓/一键平仓接口]
     * ============================================================================
     * ============================================================================
     * Page3:
     * /-
     * /-1.技术指标
     * /--(1).
     * /-2.左上页面
     * /--(1).策略服务:根据策略名称获取策略相关参数
     * /-2.左下页面
     * /--(1).投资组合接口:获取用户投资组合[股票池/目标池都通过此接口]
     *
     * @param key 关键字
     * @return 名词
     */
    @GetMapping("mapping")
    public String mapping(String key) {
        return "";
    }
}
